lib/CF/83xddNoSync/Documents/Документ2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Документ2</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РСПодчиненныйРегистратору</xr:Item>
				<xr:Item>AccountingRegister.РегистрБухгалтерии1</xr:Item>
				<xr:Item>AccumulationRegister.РегистрНакопления2</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПростойСправочник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПростойСправочник</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитЧисло</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитБулево</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПростойСправочник2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПростойСправочник2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Состав2</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитУИД</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеЗначения</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛюбаяСсылка</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lib/CF/83xddNoSync/InformationRegisters/РСПодчиненныйРегистратору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>РСПодчиненныйРегистратору</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РесурсЧисло</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РеквизитБулево</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПростойСправочник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПростойСправочник</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПростойСправочник2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПростойСправочник2</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lib/CF/83xddNoSync/AccumulationRegisters/РегистрНакопления2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>РегистрНакопления2</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РесурсЧисло</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РеквизитБулево</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПростойСправочник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПростойСправочник</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПростойСправочник2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПростойСправочник2</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

lib/CF/83xddNoSync/AccountingRegisters/РегистрБухгалтерии1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccountingRegister>
		<Properties>
			<Name>РегистрБухгалтерии1</Name>
			<ChartOfAccounts>ChartOfAccounts.ПланСчетов1</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПростойСправочник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПростойСправочник</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПростойСправочник2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПростойСправочник2</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>РесурсЧисло</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РесурсЧисло1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РеквизитБулево</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

lib/CF/83xddNoSync/Documents/Документ2/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РСПодчиненныйРегистратору
	Движения.РСПодчиненныйРегистратору.Записывать = Истина;
	Движения.РСПодчиненныйРегистратору.Очистить();
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		Движение = Движения.РСПодчиненныйРегистратору.Добавить();
		Движение.Период = Дата;
		Движение.ПростойСправочник = ПростойСправочник;
		Движение.ПростойСправочник2 = ТекСтрокаСостав.ПростойСправочник2;
		Движение.РесурсЧисло = ТекСтрокаСостав.РеквизитЧисло;
		Движение.РеквизитБулево = ТекСтрокаСостав.РеквизитБулево;
	КонецЦикла;


	// регистр РегистрНакопления2 Приход
	Движения.РегистрНакопления2.Записывать = Истина;
	Движения.РегистрНакопления2.Очистить();
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		Движение = Движения.РегистрНакопления2.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ПростойСправочник = ПростойСправочник;
		Движение.ПростойСправочник2 = ТекСтрокаСостав.ПростойСправочник2;
		Движение.РесурсЧисло = ТекСтрокаСостав.РеквизитЧисло;
		Движение.РеквизитБулево = ТекСтрокаСостав.РеквизитБулево;
	КонецЦикла;

	// регистр РегистрБухгалтерии1 
	Движения.РегистрБухгалтерии1.Записывать = Истина;
	Движения.РегистрБухгалтерии1.Очистить();
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		Движение = Движения.РегистрБухгалтерии1.Добавить();
		Движение.СчетДт = ПланыСчетов.ПланСчетов1.Счет01;
		Движение.СчетКт = ПланыСчетов.ПланСчетов1.Счет02;
		Движение.Период = Дата;
		Движение.ПростойСправочник = ПростойСправочник;
		Движение.ПростойСправочник2Дт = ТекСтрокаСостав.ПростойСправочник2;
		Движение.РесурсЧисло = ТекСтрокаСостав.РеквизитЧисло;
		Движение.РесурсЧисло1Дт = ТекСтрокаСостав.РеквизитЧисло;
		Движение.РеквизитБулево = ТекСтрокаСостав.РеквизитБулево;
		
		Движение.СубконтоДт.Вставить(ПланыВидовХарактеристик.ВидыСубконто1.Субконто1, ПростойСправочник);
		Движение.СубконтоКт.Вставить(ПланыВидовХарактеристик.ВидыСубконто1.Субконто2, ТекСтрокаСостав.ПростойСправочник2);
		Движение.СубконтоКт.Вставить(ПланыВидовХарактеристик.ВидыСубконто1.Субконто1, ПростойСправочник);
		
		Движение = Движения.РегистрБухгалтерии1.Добавить();
		Движение.СчетДт = ПланыСчетов.ПланСчетов1.СчетБезСубконто;
		Движение.Период = Дата;
		Движение.ПростойСправочник = ПростойСправочник;
		Движение.ПростойСправочник2Кт = ТекСтрокаСостав.ПростойСправочник2;
		Движение.РесурсЧисло = ТекСтрокаСостав.РеквизитЧисло;
		Движение.РесурсЧисло1Кт = ТекСтрокаСостав.РеквизитЧисло;
		Движение.РеквизитБулево = ТекСтрокаСостав.РеквизитБулево;
		
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
